<?php

//<!-- TASK 04
//<!-- Используя только две числовые переменные, поменяйте их значение местами. 
//<!-- Например, если a = 1, b = 2, надо, чтобы получилось: b = 1, a = 2. 
//<!-- Дополнительные переменные, функции и конструкции типа list() использовать нельзя.

$a = 1;
$b = 2;

$format = "a = %d; b = %d \n";
echo sprintf($format, $a, $b);

$a = $a + $b;
$b = $a - $b;
$a = $a - $b;

echo sprintf($format, $a, $b);

// docker run --rm -v $(pwd)/php-cli/:/cli php:8.3-cli php /cli/task04.php
// OUTPUT:
// a = 1; b = 2 
// a = 2; b = 1 